packages/Webkul/Checkout/src/Cart.php

select * from `products` where `products`.`id` = 265 and `products`.`id` is not null limit 1
---
    public function getItemByProduct($data, $parentData = null)
    {
        $items = $this->getCart()->all_items;
        $matchingItem = null;
        $nullInstructionItem = null;

        foreach ($items as $item) {
            if ($item->product->getTypeInstance()->compareOptions($item->additional, $data['additional'])) {
                if (isset($item['additional']['special_instruction'])) {
                    $specialInstructionMatches = $item['additional']['special_instruction'] == $data['additional']['special_instruction'];
                    $instructionIsEmpty = $item['additional']['special_instruction'] == "";
                    $itemInstruction = $data['additional']['special_instruction'] == "";

                    if ($specialInstructionMatches) {
                        if (!isset($data['additional']['parent_id'])) {
                            return $item;
                        }


                        if ($item->parent->product->getTypeInstance()->compareOptions($item->parent->additional, $parentData ?: request()->all())) {

delete from `cart_items` where `id` = 11011
---
    public function removeItem($itemId)
    {
        Event::dispatch('checkout.cart.delete.before', $itemId);

        if (! $cart = $this->getCart()) {
            return false;
        }

        if ($cartItem = $cart->items()->find($itemId)) {
            $cartItem->delete();

update `cart` set `customer_first_name` = '', `customer_last_name` = '', `cart`.`updated_at` = '2025-03-31 22:44:00' where `id` = 7920
---
        }


        $cart->save();

insert into `cart_payment` (`method`, `cart_id`, `updated_at`, `created_at`) values ('mpauthorizenet', 7920, '2025-03-31 22:44:03', '2025-03-31 22:44:03')
---
    public function savePaymentMethod($payment)
    {
        if (! $cart = $this->getCart()) {
            return false;
        }

        if ($cartPayment = $cart->payment) {
            $cartPayment->delete();
        }

        $cartPayment = new CartPayment;

        $cartPayment->method = $payment['method'];
        $cartPayment->cart_id = $cart->id;
        $cartPayment->save();

select * from `products` where `products`.`id` = 134 and `products`.`id` is not null limit 1
---
    public function calculateItemsTax($orderId=null): void
    {

       // sandeep add code for admin
        if(isset($orderId)){
            $cart = Order::where('id', $orderId)->first();
        }else{
            $cart = $this->getCart();
        }

        if (!$cart) {
            return;
        }


        Event::dispatch('checkout.cart.calculate.items.tax.before', $cart);

        foreach ($cart->items as $item) {

            $taxCategory = $this->taxCategoryRepository->find($item->product->tax_category_id);

update `cart_items` set `tax_percent` = 0, `tax_amount` = 0, `base_tax_amount` = 0, `cart_items`.`updated_at` = '2025-03-31 22:54:29' where `id` = 11022
---
            });


            $item->save();

select * from `cart_payment` where `cart_payment`.`cart_id` = 7920 and `cart_payment`.`cart_id` is not null limit 1
---
    public function toArray()
    {
        $cart = $this->getCart();

        $data = $cart->toArray();

        $data['billing_address'] = $cart->billing_address->toArray();

        if ($cart->haveStockableItems()) {
            $data['shipping_address'] = $cart->shipping_address->toArray();

            $data['selected_shipping_rate'] = $cart->selected_shipping_rate
                ? $cart->selected_shipping_rate->toArray()
                : 0;
        }

         $data['payment'] = $cart->payment->toArray();

        $data['items'] = $cart->items()->with('children')->get()->toArray();