packages/Webkul/Checkout/src/Traits/CartTools.php

    public function mergeCart(): void
    {
          /*added by umesh 04-07-2023*/
        if(auth()->guard()->check())
        {

            $user = auth()->guard()->user();
            $guestToken = Session::token();

            // sandeep add code for update deafult address and other data
            DB::table('addresses')
            ->where('customer_id', $user->id)
            ->update(['default_address' => '0']);


                 $addressId = DB::table('addresses')
                 ->where('customer_token', $guestToken)
                 ->update([
                 'first_name' => $user->first_name,
                 'last_name' => $user->last_name,
                 'customer_token' =>null,
                 'customer_id' => $user->id,
                 'default_address' => '1',
                ]);

                 echo json_encode(['status'=>'successfully guest customer airport updated']);


                //  sandeep add code to update fbo details and airport fbo
                $existingtoken = DB::table('fbo_details')
                ->where('customer_token', $guestToken)
                ->whereNotNull('customer_id') //check customer_id exist or not
                ->first();
---
update `addresses` set `default_address` = '0' where `customer_id` = 619
update `addresses` set `first_name` = 'tets', `last_name` = 'svdhv', `customer_token` = null, `customer_id` = 619, `default_address` = '1' where `customer_token` = 'SjH3OsUcFWmWAgwUjHkDYUs4GqBgrxV9Sthm8lOC'
select * from `fbo_details` where `customer_token` = 'SjH3OsUcFWmWAgwUjHkDYUs4GqBgrxV9Sthm8lOC' and `customer_id` is not null limit 1

                    //         ]);
                    //     }

                    DB::table('fbo_details')->where('customer_token', $guestToken)->update([
                        'customer_token' => null
                    ]);

                    $latestFboDetail = DB::table('fbo_details')
                            ->where('customer_id', $user->id)
                            ->orderBy('id', 'desc')
                            ->first();

                        if ($latestFboDetail) {
                            // Update latest record
                            DB::table('fbo_details')
                                ->where('id', $latestFboDetail->id)
                                ->update([
                                    'delivery_date' => $existingtoken->delivery_date,
                                    'delivery_time' => $existingtoken->delivery_time,
                                ]);
---
update `fbo_details` set `customer_token` = null where `customer_token` = 'SjH3OsUcFWmWAgwUjHkDYUs4GqBgrxV9Sthm8lOC'
select * from `fbo_details` where `customer_id` = 619 order by `id` desc limit 1
update `fbo_details` set `delivery_date` = '2025-04-01', `delivery_time` = '4:00 AM' where `id` = 5788

                }


                $existingAirportFbo = DB::table('airport_fbo_details')
                ->where('customer_token', $guestToken)
                ->first();

                if($existingAirportFbo){
                    DB::table('airport_fbo_details')
                    ->where('customer_token', $guestToken)
                    ->update([
                        'customer_id' => $user->id,
                        'customer_token' => null
                    ]);
---
select * from `airport_fbo_details` where `customer_token` = 'SjH3OsUcFWmWAgwUjHkDYUs4GqBgrxV9Sthm8lOC' limit 1
update `airport_fbo_details` set `customer_id` = 619, `customer_token` = null where `customer_token` = 'SjH3OsUcFWmWAgwUjHkDYUs4GqBgrxV9Sthm8lOC'