packages/Webkul/Sales/src/Generators/OrderSequencer.php

    public function getLastId()
    {
log::info('getlastId function');
        $lastOrder = Order::query()->orderBy('id', 'desc')->limit(1)->first();
---
select * from `orders` order by `id` desc limit 1