packages/Webkul/Notification/src/Http/Controllers/Admin/NotificationController.php

    public function getNotifications()
    {
        $params = request()->all();

        if (isset($params['page'])) {
            unset($params['page']);
        }

        if (count($params)) {
            $searchResults = $this->notificationRepository->getParamsData($params);
        } else {
            $searchResults = $this->notificationRepository->with('order')->latest()->paginate(10);
        }

        return [
            'search_results' => $searchResults,
            'total_unread'   => $this->notificationRepository->where('read', 0)->count(),
---
select count(*) as aggregate from `notifications` where `read` = 0