packages/Webkul/MpAuthorizeNet/src/Http/Controllers/MpAuthorizeNetConnectController.php

                            $customerEmail = Cart::getCart()->customer_email;
                            $customerName = Cart::getCart()->customer_first_name . ' ' . Cart::getCart()->customer_last_name ?? "";
                    }else{
                            $fboDetails = DB::table('fbo_details')
                            ->where('customer_token', $token)
                            ->whereNotNull('customer_token')
                            ->orderBy('id', 'DESC')
                            ->first();
---
select * from `fbo_details` where `customer_token` = 'MYZdWWUeHw884iNPqN02L1ZoP0ibyhGdjzi89mgD' and `customer_token` is not null order by `id` desc limit 1