packages/Webkul/Velocity/src/Http/Controllers/Shop/ShopController.php

    public function getCategorydetail($categoryId)
    {
        /* fetch category details */
        $categoryDetails = $this->categoryRepository->find($categoryId);

        if (!$categoryDetails) {
            /* if category not found then return empty response */
            return response()->json([
                'products' => [],
                'paginationHTML' => '',
                'product_category' => [],

            ]);
        }

        /* fetching products */
        $products = $this->productRepository->getAll($categoryId);
        $products->withPath($categoryDetails->slug);
        $productCategoryId = array_map('intval', explode(',', $categoryId)); //converted to integer


        /* sending response */
        return response()->json([
            'products' => collect($products->items())->map(function ($product) {
                return $this->velocityHelper->formatProduct($product);
            }),
            'paginationHTML' => $products->appends(request()->input())->links()->toHtml(),
            'product_category' => DB::table('product_categories')
                ->select('*')
                ->whereIn('category_id', $productCategoryId)
                ->get(),
---
select * from `product_categories` where `category_id` in (19, 26)