packages/Webkul/Core/src/Core.php

select `locales`.*, `channel_locales`.`channel_id` as `pivot_channel_id`, `channel_locales`.`locale_id` as `pivot_locale_id` from `locales` inner join `channel_locales` on `locales`.`id` = `channel_locales`.`locale_id` where `channel_locales`.`channel_id` = 1 order by `name` asc
---
    public function getAllLocalesByRequestedChannel()
    {
        static $data = [];

        if (! empty($data)) {
            return $data;
        }

        $channel = $this->channelRepository->findOneByField('code', $this->getRequestedChannelCode());

        return $data = [
            'channel' => $channel,
            'locales' => $channel->locales()->orderBy('name')->get(),