packages/Webkul/Product/src/Type/Configurable.php

    public function getBaseImage($item)
    {
        $product = $item->product;

        if ($item instanceof \Webkul\Customer\Contracts\Wishlist) {
            if (isset($item->additional['selected_configurable_option'])) {
                $product = $this->productRepository->find($item->additional['selected_configurable_option']);
---
select * from `products` where `products`.`id` = 135 and `products`.`id` is not null limit 1