packages/Webkul/Product/src/Repositories/ProductRepository.php

    public function findByAttributeCode($code, $value)
    {
        $attribute = $this->attributeRepository->findOneByField('code', $code);

        $attributeValues = $this->productAttributeValueRepository->findWhere([
            'attribute_id' => $attribute->id,
            $attribute->column_name => $value,
        ]);

        if ($attribute->value_per_channel) {
            if ($attribute->value_per_locale) {
                $attributeValues = $attributeValues
                    ->where('channel', core()->getRequestedChannelCode())
                    ->where('locale', core()->getRequestedLocaleCode());
            } else {
                $attributeValues = $attributeValues
                    ->where('channel', core()->getRequestedChannelCode());
            }
        } else {
            if ($attribute->value_per_locale) {
                $attributeValues = $attributeValues
                    ->where('locale', core()->getRequestedLocaleCode());
            }
        }

        return $attributeValues->first()?->product;
---
select * from `products` where `products`.`id` = 134 limit 1