packages/Webkul/Velocity/src/Helpers/Helper.php

    public function topBrand($order)
    {
        foreach ($order->items as $orderItem) {
            try {
                $this->orderBrandsRepository->create([
                    'order_item_id' => $orderItem->id,
                    'order_id' => $orderItem->order_id,
                    'product_id' => $orderItem->product_id,
                    'brand' => $orderItem->product->brand,
                ]);
---
select * from `products` where `products`.`id` = 265 limit 1