packages/Webkul/Product/src/Helpers/ConfigurableOption.php

select * from `product_attribute_values` where `product_attribute_values`.`product_id` in (135, 136)
select * from `product_inventory_indices` where `product_inventory_indices`.`product_id` in (135, 136)
select * from `product_price_indices` where `product_price_indices`.`product_id` in (135, 136)
---
    public function getAllowedProducts($product)
    {
        static $variants = [];

        if (count($variants)) {
            return $variants;
        }

        $variantCollection = $product->variants()
            ->with([
                'parent',
                'attribute_values',
                'price_indices',
                'inventory_indices',
                'images',
                'videos',
            ])
            ->get();

select `attributes`.*, `product_super_attributes`.`product_id` as `pivot_product_id`, `product_super_attributes`.`attribute_id` as `pivot_attribute_id` from `attributes` inner join `product_super_attributes` on `attributes`.`id` = `product_super_attributes`.`attribute_id` where `product_super_attributes`.`product_id` = 134
---
    public function getAllowAttributes($product)
    {
        static $productSuperAttributes = [];

        if (isset($productSuperAttributes[$product->id])) {
            return $productSuperAttributes[$product->id];
        }

        return $productSuperAttributes[$product->id] = $product->super_attributes()
            ->with(['translation', 'options', 'options.translation'])
            ->get();