packages/ACME/CateringPackage/src/Http/Controllers/Shop/CateringPackageController.php

select * from `delivery_location_airports` where `active` = '1' and (`name` like '%%' or `address` like '%%')
---
    public function index(Request $request)
    {

        if ($request->ajax() && $request->type === 'load_all_airports') {

            $addresses = DB::table('delivery_location_airports')
                ->where('active', '1')
                ->get();

            return response()->json($addresses);
        }

        if ($request->ajax() && $request->type === 'address_search') {

            // dd($request);
            // $addresses  = Db::table('delivery_location_airports')->where('name', 'like', '%' . $request->name . '%')->get();

            // $addresses = DB::table('delivery_location_airports')->where('active','1')->where('name', 'like', '%' . $request->name . '%')->orWhere('address', 'like', '%' . $request->name . '%')->get();

            $addresses = DB::table('delivery_location_airports')
                ->where('active', '1')
                ->where(function ($query) use ($request) {
                    $query->where('name', 'like', '%' . $request->name . '%')
                        ->orWhere('address', 'like', '%' . $request->name . '%');
                })
                ->get();

select * from `airport_fbo_details` where `airport_id` = '2' and ((`customer_id` is null and `customer_token` is null) or (`customer_token` = 'SjH3OsUcFWmWAgwUjHkDYUs4GqBgrxV9Sthm8lOC'))
---
            return $output;
        } elseif ($request->ajax() && $request->type == 'airport_fbo_detail') {

            $airport_fbo_details = DB::table('airport_fbo_details')
                ->where('airport_id', $request->airport_id)
                ->where(function ($query) {
                    $query->where(function ($subquery) {
                        $subquery->whereNull('customer_id')
                            ->whereNull('customer_token');
                    })
                        ->orWhere(function ($subquery) {
                            if (auth()->guard('customer')->check()) {
                                $subquery->Where('customer_id', auth()->guard('customer')->user()->id);
                            } else {
                                $subquery->Where('customer_token', request()->input('_token'));
                            }
                        });
                })
                ->get();

select `customer_id` from `fbo_details`
select * from `fbo_details` where `customer_id` = 619 order by `id` desc limit 1
---

            //   sandeep add code update latest fbo details
            if (Auth::check() === true) {
                $customer_id = DB::table('fbo_details')->pluck('customer_id')->toArray();

                $latestRecord = DB::table('fbo_details')
                    ->where('customer_id', auth()->user()->id)
                    ->orderBy('id', 'desc')
                    ->first();

insert into `fbo_details` (`delivery_time`, `delivery_date`, `customer_id`) values ('3:30 AM', '2025-4-1', 619)
select * from `fbo_details` where `customer_token` = 'SjH3OsUcFWmWAgwUjHkDYUs4GqBgrxV9Sthm8lOC' order by `id` desc limit 1
---
                            'delivery_date' => $formattedDate,
                        ]);
                } else {
                    DB::table('fbo_details')
                        ->insert([
                            'delivery_time' => $request->time,
                            'delivery_date' => $formattedDate,
                            'customer_id' => auth()->user()->id,
                        ]);
                }
                session(['token' => $customer_token]);
            } else {
                $latestRecord = DB::table('fbo_details')
                    ->where('customer_token', $customer_token)
                    ->orderBy('id', 'desc')
                    ->first();

insert into `fbo_details` (`delivery_time`, `delivery_date`, `customer_token`) values ('4:00 AM', '2025-4-1', 'SjH3OsUcFWmWAgwUjHkDYUs4GqBgrxV9Sthm8lOC')
---
                            'delivery_date' => $formattedDate,
                        ]);
                } else {
                    DB::table('fbo_details')
                        ->insert([
                            'delivery_time' => $request->time,
                            'delivery_date' => $formattedDate,
                            'customer_token' => $customer_token,
                        ]);

select * from `delivery_location_airports` where `id` = '1' limit 1
select * from `country_states` where `id` = 4 limit 1
---

        if (!isset($request->time_update) && $request->time_update != true && !request()->has('type')) {

            $airport_data = Db::table('delivery_location_airports')->where('id', $request->airport_id)->first();

            $country_states = Db::table('country_states')->where('id', $airport_data->state)->first();

select `customer_id` from `addresses`
select * from `addresses` where `id` = 27845 limit 1
insert into `addresses` (`postcode`, `state`, `country`, `address1`, `customer_id`, `first_name`, `last_name`, `email`, `airport_name`, `address_type`, `airport_fbo_id`, `created_at`) values (85034, 'AZ', 'US', '3400 E Sky Harbor Blvd, Phoenix, AZ 85034, United States', 619, 'tets', 'svdhv', 'tanish@mindwebtree.com', 'Phoenix Sky Harbor PHX', 'customer', '5344', '2025-04-01 03:19:26')
---
            // $airport_data = Db::table('delivery_location_airports')->where('id',$request->airport_id)->first();

            // $country_states = Db::table('country_states')->where('id', $airport_data->state)->first();
            $addresses = Db::table('addresses')->pluck('customer_id')->toArray();

            if (!in_array($customer->id, $addresses)) {

                $addressId = DB::table('addresses')->insertGetId([
                    'postcode' => $airport_data->zipcode,
                    'state' => $country_states->code,
                    'country' => $country_states->country_code,
                    'address1' => $airport_data->address,
                    'customer_id' => $customer->id,
                    'first_name' => $customer->first_name,
                    'last_name' => $customer->last_name,
                    'email' => $customer->email,
                    'airport_name' => $airport_data->name,
                    'address_type' => 'customer',
                    'airport_fbo_id' => $request->input('selected_fbo_id'),
                    'created_at' => now(),
                ]);

select `customer_token` from `addresses`
insert into `addresses` (`postcode`, `state`, `country`, `address1`, `customer_token`, `airport_name`, `address_type`, `airport_fbo_id`, `created_at`) values (85260, 'AZ', 'US', '15000 N Airport Dr, Scottsdale, AZ 85260, United States', 'SjH3OsUcFWmWAgwUjHkDYUs4GqBgrxV9Sthm8lOC', 'Scottsdale Airport SDL', 'customer', '5346', '2025-04-01 03:21:32')
select * from `addresses` where `id` = 27851 limit 1
---

            session(['token' => $request->_token]);

            $addresses = Db::table('addresses')->pluck('customer_token')->toArray();
            if (!in_array($request->customer_token, $addresses)) {

                $addressId = DB::table('addresses')->insertGetId([

                    'postcode' => $airport_data->zipcode,
                    'state' => $country_states->code,
                    'country' => $country_states->country_code,
                    'address1' => $airport_data->address,
                    'customer_token' => $request->customer_token,
                    'airport_name' => $airport_data->name,
                    'address_type' => 'customer',
                    'airport_fbo_id' => $request->input('selected_fbo_id'),
                    'created_at' => now(),
                ]);

insert into `airport_fbo_details` (`name`, `address`, `airport_id`, `notes`, `customer_id`, `customer_token`) values ('adsf', 'dsfgdsg', '1', '', 619, null)
---
    public function store()
    {
        $validatedData = $this->validate(request(), [
            'name' => 'required',
            'address' => 'required',
        ]);

        // Check if the user is authenticated
        if (auth()->check()) {
            $customerId = auth()->user()->id;
            $customerToken = null;
        } else {
            $customerId = null;
            $customerToken = request()->input('_token');
        }

        $insertedId = DB::table('airport_fbo_details')->insertGetId([
            'name' => $validatedData['name'],
            'address' => $validatedData['address'],
            'airport_id' => request()->input('airport_id'),
            'notes' => request()->input('notes'),
            'customer_id' => $customerId,
            'customer_token' => $customerToken,
        ]);

select * from `airport_fbo_details` where `id` = 5344 limit 1
---
        $query->update(['airport_fbo_id' => $insertedId]);

        // Log::info('Inserted record ID: ' . $insertedId);
        $insertedRecord = DB::table('airport_fbo_details')->where('id', $insertedId)->first();