packages/ACME/CateringPackage/src/Http/Controllers/Shop/CheckoutController.php

select * from `fbo_details` where `customer_token` is null order by `id` desc limit 1
---
        //         ->first();
        // }

        $fboDetails = DB::table('fbo_details')
            ->where($customerId ? 'customer_id' : 'customer_token', $customerId ?: $token)
            ->orderBy('id', 'DESC')
            ->first();

select * from `addresses` where `customer_token` is null and `address_type` = 'customer' and `customer_token` is not null order by `id` desc limit 1
---

        // dd(auth()->check());
        /* GET CUSTOMER ADDRESS*/
        $customer_address = DB::table('addresses')
            ->where(auth()->check() ? 'customer_id' : 'customer_token', auth()->user()->id ?? $token)
            ->where('address_type', 'customer')
            ->whereNotNull('customer_token')
            ->orderBy('id', 'DESC')
            ->first();

select `id` from `delivery_location_airports` where `name` = 'Scottsdale Airport SDL' limit 1
select `address1`, `country` from `addresses` where `id` = 27840 limit 1
---
    public function saveAddress(CustomerAddressForm $request)
    {

        log::info('saveAddress');
        $data = $request->all();

        if (
            !auth()->guard('customer')->check()
            && !Cart::getCart()->hasGuestCheckoutItems()
        ) {
            log::info('first');
            return response()->json(['redirect_url' => route('shop.customer.session.index')], 403);
        }

        $data['billing']['address1'] = implode(PHP_EOL, array_filter($data['billing']['address1']));
        $data['shipping']['address1'] = implode(PHP_EOL, array_filter($data['shipping']['address1']));
        if (isset($data['billing']['airport_name'])) {
            $data['billing']['airport_name'] = implode(PHP_EOL, array_filter($data['billing']['airport_name']));
            $airport_id = DB::table('delivery_location_airports')
                ->where('name', $data['billing']['airport_name'])
                ->value('id');
        }

        // sandeep add code for guest user add country and address1 data
        if(!auth()->guard('customer')->check()){
          $addressData =   DB::table('addresses')
                            ->where('id',$data['billing']['address_id'])
                            ->select('address1','country')->first();

select `airport_name`, `address1`, `city`, `delivery_date` from `addresses` where `address_type` = 'customer' and `customer_token` = 'MYZdWWUeHw884iNPqN02L1ZoP0ibyhGdjzi89mgD' limit 1
update `addresses` set `airport_name` = 'Phoenix Sky Harbor PHX', `address1` = '3400 E Sky Harbor Blvd, Phoenix, AZ 85034, United States', `city` = '' where `address_type` = 'order_shipping' and `order_id` = 8761
---
                    ]);
            }
        } else {
            $airport_name = DB::table('addresses')
                ->select('airport_name', 'address1', 'city', 'delivery_date')
                ->where('address_type', 'customer')
                ->Where('customer_token', $token)
                ->first();

            if ($airport_name) {
                DB::table('addresses')
                    ->where('address_type', 'order_shipping')
                    ->where('order_id', $orderId)
                    ->update([
                        'airport_name' => $airport_name->airport_name,
                        'address1' => $airport_name->address1,
                        'city' => $airport_name->city,
                    ]);

select * from `fbo_details` where `customer_token` = 'MYZdWWUeHw884iNPqN02L1ZoP0ibyhGdjzi89mgD' order by `id` desc limit 1
---
                ->orderBy('id', 'DESC')
                ->first();
        } else {
            $fboDetails = DB::table('fbo_details')
                ->where('customer_token', $token)
                ->orderBy('id', 'DESC')
                ->first();

select `airport_name`, `address1` from `addresses` where `address_type` = 'order_shipping' and `order_id` = 8761 limit 1
update `fbo_details` set `delivery_time` = null, `delivery_date` = null where `id` = 5787
select `id` from `customers` where `token` = 'MYZdWWUeHw884iNPqN02L1ZoP0ibyhGdjzi89mgD' limit 1
---
        }


        $billing_address = DB::table('addresses')
            ->select('airport_name', 'address1')
            ->where('address_type', 'order_shipping')
            ->where('order_id', $orderId)
            ->first();

        // DD($billing_address);
        if ($fboDetails) {
            DB::table('fbo_details')
                ->where('id', $fboDetails->id)
                ->update([
                    'delivery_time' => null,
                    'delivery_date' => null,
                ]);
        }

        // dd(auth()->user()->id);
        $customer = DB::table('customers')
            ->select('id')
            ->where('token', $token)
            ->first();

select `airport_fbo_id` from `addresses` where `address_type` = 'customer' and `customer_token` = 'MYZdWWUeHw884iNPqN02L1ZoP0ibyhGdjzi89mgD' order by `created_at` desc limit 1
---
            // }


        $airport_fbo_id = DB::table('addresses')
            ->select('airport_fbo_id')
            ->where('address_type', 'customer')
            ->where(auth()->check() ? 'customer_id' : 'customer_token', auth()->check() ? auth()->user()->id : $token)
            ->latest('created_at')
            ->first();

update `addresses` set `default_address` = '0' where `customer_token` = 'MYZdWWUeHw884iNPqN02L1ZoP0ibyhGdjzi89mgD'
update `addresses` set `default_address` = '1' where `airport_name` = 'Phoenix Sky Harbor PHX' and `airport_fbo_id` = 5343 and `customer_token` = 'MYZdWWUeHw884iNPqN02L1ZoP0ibyhGdjzi89mgD' order by `id` desc
---
        //   dd($airport_fbo_id);
        //  sandeep update default address
        if ($customerId != '') {
            DB::table('addresses')
                ->where('customer_id', $customerId)
                ->update(['default_address' => '0']);

            // Set the selected address as default
            DB::table('addresses')
                ->where('airport_name', $airport_name->name)
                ->where('airport_fbo_id', $airport_fbo_id->airport_fbo_id)
                ->where('customer_id', $customerId)
                ->orderBy('id', 'desc')
                ->update([
                    'default_address' => '1',
                ]);

update `orders` set `fbo_full_name` = 'test tst', `fbo_phone_number` = '(098) 977-7674', `fbo_email_address` = 'ram@mindwebtree.com', `fbo_tail_number` = 'sadsd', `fbo_packaging` = 'Microwave', `fbo_service_packaging` = 'Bulk Packaging', `status` = 'pending', `status_id` = 1, `customer_id` = 885, `delivery_date` = '2025-03-31', `delivery_time` = '10:45 PM', `airport_fbo_id` = 5343 where `id` = 8761
update `airport_fbo_details` set `customer_id` = 885 where `customer_token` = 'MYZdWWUeHw884iNPqN02L1ZoP0ibyhGdjzi89mgD'
insert into `order_status_log` (`order_id`, `user_id`, `is_admin`, `status_id`, `email`) values (8761, 885, 0, 1, 'ram@mindwebtree.com')
---
                'email' => $email,
            ]);
        } else {
            DB::table('orders')
                ->where('id', $orderId)
                ->update([
                    'fbo_full_name' => $fboDetails->full_name,
                    'fbo_phone_number' => $fboDetails->phone_number,
                    'fbo_email_address' => $fboDetails->email_address,
                    'fbo_tail_number' => $fboDetails->tail_number,
                    'fbo_packaging' => $fboDetails->packaging_section,
                    'fbo_service_packaging' => $fboDetails->service_packaging,
                    'status' => 'pending',
                    'status_id' => 1,
                    'customer_id' => $customer->id,
                    'delivery_date' => $fboDetails->delivery_date,
                    'delivery_time' => $fboDetails->delivery_time,
                    'airport_fbo_id' => $airport_fbo_id->airport_fbo_id,
                ]);
            DB::table('airport_fbo_details')
                ->where('customer_token', $token)
                ->update([
                    'customer_id' => $customer->id,
                ]);

            DB::table('order_status_log')->insert([
                'order_id' => $orderId,
                'user_id' => $customer->id,
                'is_admin' => 0,
                'status_id' => 1,
                'email' => $fboDetails->email_address,
            ]);

update `addresses` set `postcode` = null, `state` = null, `address1` = null, `country` = null, `last_name` = null, `first_name` = null, `email` = null where `address_type` = 'order_billing' and `order_id` = 8761
select `order_items`.`name`, `order_items`.`parent_id`, `order_items`.`additional`, `order_items`.`qty_ordered`, `addresses`.`airport_name`, `addresses`.`address1`, `addresses`.`address_type`, `orders`.`fbo_full_name`, `airport_fbo_details`.`name` as `fbo_airport_name`, `airport_fbo_details`.`address` as `fbo_airport_address`, `orders`.`fbo_phone_number`, `orders`.`fbo_email_address`, `orders`.`fbo_tail_number`, `orders`.`fbo_packaging`, `orders`.`fbo_service_packaging` from `order_items` inner join `orders` on `order_items`.`order_id` = `orders`.`id` left join `addresses` on `order_items`.`order_id` = `addresses`.`order_id` left join `airport_fbo_details` on `orders`.`airport_fbo_id` = `airport_fbo_details`.`id` where `order_items`.`order_id` = 8761 and `addresses`.`address_type` = 'order_shipping' and `order_items`.`parent_id` is null
---
        }


        DB::table('addresses')
            ->where('address_type', 'order_billing')
            ->where('order_id', $orderId)
            ->update([
                'postcode' => null,
                'state' => null,
                'address1' => null,
                'country' => null,
                'last_name' => null,
                'first_name' => null,
                'email' => null,
            ]);


        $orderDetails = DB::table('order_items')
            ->select(
                'order_items.name',
                'order_items.parent_id',
                'order_items.additional',
                'order_items.qty_ordered',
                'addresses.airport_name',
                'addresses.address1',
                'addresses.address_type',
                'orders.fbo_full_name',
                'airport_fbo_details.name as fbo_airport_name',
                'airport_fbo_details.address as fbo_airport_address',
                'orders.fbo_phone_number',
                'orders.fbo_email_address',
                'orders.fbo_tail_number',
                'orders.fbo_packaging',
                'orders.fbo_service_packaging'
            )
            ->join('orders', 'order_items.order_id', '=', 'orders.id')
            ->leftjoin('addresses', 'order_items.order_id', '=', 'addresses.order_id')
            ->leftjoin('airport_fbo_details', 'orders.airport_fbo_id', '=', 'airport_fbo_details.id')
            ->where('order_items.order_id', $orderId)
            ->where('addresses.address_type', 'order_shipping')
            ->whereNull('order_items.parent_id')
            ->get();