packages/ACME/CateringPackage/src/Http/Controllers/Shop/SignUpController.php

select * from `fbo_details` where `customer_id` = 619 order by `id` desc limit 1
update `fbo_details` set `full_name` = 'tets svdhv', `phone_number` = '(234) 234-1233', `email_address` = 'tanish@mindwebtree.com', `tail_number` = '3544654', `packaging_section` = 'Microwave', `service_packaging` = 'Bulk Packaging', `delivery_time` = '3:30 AM', `delivery_date` = '2025-4-1' where `id` = 5788
---
    public function add_fbo_details(Request $request)
    {
        $validate = $request->validate([
            'fullname' => 'required|max:30'
        ]);

        $customer_token = $request->_token;
        $dateString = $request->delivery_date;

        if ($dateString == "Today") {

            $date = new DateTime(); // Set date to today
        } elseif ($dateString == "Tomorrow") {
            $date = new DateTime('+1 day'); // Set date to tomorrow
        } else {
            // Parse the date string
            $date = DateTime::createFromFormat('l n/j', $dateString);
        }

        // Format the date as desired
        $formattedDate = $date->format('Y-n-j');


        if (Auth::check() === true) {

            $latestRecord = DB::table('fbo_details')
                ->where('customer_id', auth()->user()->id)
                ->orderByDesc('id')
                ->first();

            if ($latestRecord) {
                // Update the latest record with the provided data
                DB::table('fbo_details')
                    ->where('id', $latestRecord->id)
                    ->update([
                        'full_name' => $validate['fullname'],
                        'phone_number' => $request->phonenumber,
                        'email_address' => $request->email,
                        'tail_number' => $request->tailnumber,
                        'packaging_section' => $request->packagingsection,
                        'service_packaging' => $request->servicepackaging,
                        'delivery_time' => $request->delivery_time,
                        'delivery_date' => $formattedDate,
                    ]);

select `customer_token` from `fbo_details`
---


        } else {
            $token = DB::table('fbo_details')->pluck('customer_token')->toArray();

select * from `fbo_details` where `customer_token` = 'MYZdWWUeHw884iNPqN02L1ZoP0ibyhGdjzi89mgD' order by `id` desc limit 1
update `fbo_details` set `full_name` = 'test tst', `phone_number` = '(098) 977-7674', `email_address` = 'ram@mindwebtree.com', `tail_number` = 'sadsd', `packaging_section` = 'Microwave', `service_packaging` = 'Bulk Packaging', `delivery_time` = '10:45 PM', `delivery_date` = '2025-3-31' where `id` = 5787
---



            $latestRecord = DB::table('fbo_details')
                ->where('customer_token', $customer_token)
                ->orderByDesc('id')
                ->first();

            if ($latestRecord) {
                // Update the latest record with the provided data
                DB::table('fbo_details')
                    ->where('id', $latestRecord->id)
                    ->update([
                        'full_name' => $request->fullname,
                        'phone_number' => $request->phonenumber,
                        'email_address' => $request->email,
                        'tail_number' => $request->tailnumber,
                        'packaging_section' => $request->packagingsection,
                        'service_packaging' => $request->servicepackaging,
                        'delivery_time' => $request->delivery_time,
                        'delivery_date' => $formattedDate,
                    ]);