app/Logging/DatabaseErrorHandler.php

insert into `logs` (`message`, `message_type`, `page_url`, `customer_id`, `created_at`, `updated_at`) values ('function called', 'ERROR', 'https://catering.volantiscottsdale.com/address/create', 619, '2025-04-01 03:19:26', '2025-04-01 03:19:26')
---
    protected function write(LogRecord $record): void
    {
        // Extract basic information
        $message = $record->message;
        $level = $record->level->getName();
        $url = request()->fullUrl();
        $path = request()->path();

        // Skip logging for asset files and theme-related URLs
        if (
            preg_match('/(\.js|\.css|\.png|\.jpg|\.jpeg|\.gif|\.svg|\.map)$/i', $path) ||
            stripos($path, 'themes/') !== false ||
            stripos($path, 'assets/') !== false
        ) {
            return;
        }



        // Insert error log entry into database
        DB::table('logs')->insert([
            'message' => $message,
            'message_type' => $level,
            'page_url' => $url,
            'customer_id' => auth()->check() ? auth()->id() : null,
            'created_at' => now(),
            'updated_at' => now(),
        ]);