packages/Webkul/Sales/src/Repositories/OrderRepository.php

insert into `orders` (`cart_id`, `customer_id`, `is_guest`, `customer_email`, `customer_first_name`, `customer_last_name`, `total_item_count`, `total_qty_ordered`, `base_currency_code`, `channel_currency_code`, `order_currency_code`, `grand_total`, `base_grand_total`, `sub_total`, `base_sub_total`, `tax_amount`, `base_tax_amount`, `coupon_code`, `applied_cart_rule_ids`, `discount_amount`, `base_discount_amount`, `shipping_method`, `shipping_title`, `shipping_description`, `shipping_amount`, `base_shipping_amount`, `shipping_discount_amount`, `base_shipping_discount_amount`, `channel_id`, `channel_type`, `channel_name`, `status`, `increment_id`, `updated_at`, `created_at`) values (7920, null, 1, null, '', '', 3, '3.0000', 'USD', 'USD', 'USD', '88.0700', '88.0700', '82.8500', '82.8500', '5.2200', '5.2200', null, '', '0.0000', '0.0000', 'free_free', 'Free Shipping - Free Shipping', 'Free Shipping', 0, 0, '0.0000', '0.0000', 1, 'Webkul\\Core\\Models\\Channel', 'Default', 'pending', '8761', '2025-03-31 22:44:13', '2025-03-31 22:44:13')
insert into `order_payment` (`method`, `method_title`, `order_id`, `updated_at`, `created_at`) values ('mpauthorizenet', null, 8761, '2025-03-31 22:44:13', '2025-03-31 22:44:13')
insert into `addresses` (`address_type`, `order_id`, `first_name`, `last_name`, `gender`, `company_name`, `airport_name`, `address1`, `address2`, `postcode`, `city`, `state`, `country`, `email`, `airport_fbo_id`, `phone`, `vat_id`, `default_address`, `additional`, `updated_at`, `created_at`) values ('order_shipping', 8761, '', '', null, null, 'Phoenix Sky Harbor PHX', '3400 E Sky Harbor Blvd, Phoenix, AZ 85034, United States', null, '85034', '', 'AZ', 'US', null, 5343, null, null, 0, null, '2025-03-31 22:44:13', '2025-03-31 22:44:13')
---
    public function createOrderIfNotThenRetry(array $data)
    {
        DB::beginTransaction();
        try {
            Event::dispatch('checkout.order.save.before', [$data]);

            if (! empty($data['customer'])) {
                $data['customer_id'] = $data['customer']->id;
                $data['customer_type'] = get_class($data['customer']);
            } else {
                unset($data['customer']);
            }

            if (! empty($data['channel'])) {
                $data['channel_id'] = $data['channel']->id;
                $data['channel_type'] = get_class($data['channel']);
                $data['channel_name'] = $data['channel']->name;
            } else {
                unset($data['channel']);
            }

            $data['status'] = 'pending';
            $order = $this->model->create(array_merge($data, ['increment_id' => $this->generateIncrementId()]));

            $order->payment()->create($data['payment']);

            if (isset($data['shipping_address'])) {
                unset($data['shipping_address']['customer_id']);

              $order->addresses()->create($data['shipping_address']);

insert into `addresses` (`address_type`, `order_id`, `first_name`, `last_name`, `gender`, `company_name`, `airport_name`, `address1`, `address2`, `postcode`, `city`, `state`, `country`, `email`, `airport_fbo_id`, `phone`, `vat_id`, `default_address`, `additional`, `updated_at`, `created_at`) values ('order_billing', 8761, '', '', null, null, 'Phoenix Sky Harbor PHX', '3400 E Sky Harbor Blvd, Phoenix, AZ 85034, United States', null, '85034', '', 'AZ', 'US', null, 5343, null, null, 0, null, '2025-03-31 22:44:13', '2025-03-31 22:44:13')
---

            unset($data['billing_address']['customer_id']);

            $order->addresses()->create($data['billing_address']);